Конфигурация/Catalogs/ДоговорыБрокерскогоОбслуживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДоговорыБрокерскогоОбслуживания</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеВладельцаДляДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/ДоговорыБрокерскогоОбслуживания/Ext/ManagerModule.bsl
Функция СформироватьНаименование(РеквизитыДоговора, ЗадействованныеРеквизиты = "") Экспорт
	
	ЗадействованныеРеквизиты = "Контрагент, НомерДоговора, ДатаЗаключения";
	
	Если РеквизитыДоговора = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НаименованиеДоговора = "";
	
	Если ЗначениеЗаполнено(РеквизитыДоговора.Контрагент) И Не ПустаяСтрока(РеквизитыДоговора.НомерДоговора) И ЗначениеЗаполнено(РеквизитыДоговора.ДатаЗаключения) Тогда
		НаименованиеДоговора = "" + РеквизитыДоговора.Контрагент + ", № " + СокрЛП(РеквизитыДоговора.НомерДоговора) + " от " + Формат(РеквизитыДоговора.ДатаЗаключения, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Возврат НаименованиеДоговора;
	
КонецФункции // СформироватьНаименование
